//Задание 2 - UI тесты selenium/selenide
//ссылка на UI - https://www.demoblaze.com/
//Кейс 1:
//  1.Зарегистрироваться под любыми данными(использовать библиотеку для генерации
//    тестовых данных)
//  2.Залогиниться с этими данными
//  3.Добавить в корзину по одному любому гаджету из каждой категории
//  4.Сравнить цену из общего списка и с карточки товара
//  5.Перейти в корзину и убедиться, что общая цена посчитана верно
//  6.Оформить заказ
//  7.Убедиться что дата в конце заказа совпадает с датой в системе
//    В реализации необходимо использовать только xpath, паттерны Page object, Page
//    factory
import org.junit.jupiter.api.Test;



public class TestsUI extends BaseTests{

    @Test
    public void registrationCheckPO(){

    }

    @Test
    public void registrationCheckPF(){

    }






























}
